
let user = {
    name: 'Viktor',
    age: 23,
    email: 'victor@socialki.net',
    password: "12345",
    car: false,
    apartment:true,
    house: false,
    smoking: false,
    company: "ELEKS",
};

let arr = ['Hello',78,6,'World',4,765136,134,843];

/**Таким методом нам потрыбно пробігати по масиву три рази щоб витягнути кожен з елементів по черзі, це бє по перфоренсу, і багато коду*/
/*
let age = user.age;
let name = user.name;
let company = user.company;
*/

/*const name = 'Dimas';*/ //Якщо в нас вже десь оголошена змынна з таким ключем тоды ми в деструктуризацыъ просто перейменовуєм змінну в деструктуризації

/**Деструктуризація*/
/**За допомогою деструктуризації ми витягуєм всі ці три значення за один прохід по масиву, і реалізовуєм це одною строчкою коду*/
/**Деструктуризація обєкту*/
/*let {company, age, name: username/!*Таким методом перейменовується змінна в деструктуризації*!/} = user;//Так витягуюються елементи за допомогою деструктуризації.
console.log(company);
console.log(name);
console.log(username);*/


/**Деструктуризація масиву*/

/*
let [,,,,test] = arr;//Так виводитьс конкретний елемент з масиву але робити дальше третього поганий тон.

console.log(test);

let [text, numberOfArr] = arr;//Таким чином деструктуризуэм масив вказуэм змінні які ми хочемо присвоїти елементу масива , змінна відповідає індексу масива 0 1 ... 99 .

console.log(text);
console.log(numberOfArr);

let [someNumber, anotherNumber, ...spread] = arr; // Якщо вивести спред тоді цей спред засуне в новий масив все що не викликалось у змінних назвати можна як хочеш.

console.log(spread);
*/

/*
function f() {
    let r = Object.values(arguments);
    console.log(...r); // Таким записом можна розерити масив ы вивести його елементи окремими цифрами.
}

f(6456456,4564,4,64,654,564,6546,);
*/


/**Це називається структуризація*/
//Якщо значення і ключ співпадає тоді ми просто при побудові масиву вписуєм тільки назву змінної.
/*
let name = 'Viktor';
let age = 23;

let userr = {
    name,
    age
};

console.log(userr);
*/
